package com.javarush.island.zonov.constants;

public class ConsoleViewConstants {
    public static final String GREETING = "Добро пожаловать в симуляцию жизни на острове.\n" +
            "Здесь представлено 15 видов животных, из которых:\n" +
            "- 10 видов травоядных животных\n" +
            "- 5 видов хищных животных\n" +
            "А также один вид растений в качестве пищи для травоядных.\n" +
            "Сам остров состоит из клеток (квадратов), у каждого квадрата есть свои координаты.\n" +
            "Животные могут передвигаться по острову в разные квадраты, поедать друг друга и размножаться с животными своего вида";

    public static final String FIRST_CHOICE = "Если Вы пользуетесь программой впервые - нажмите Enter для создания острова с нуля и следуйте дальнейшим инструкциям.\n" +
            "Или введите 0 для загрузки предыдущего состояния острова";
}
